imjustadog/string-jn5168-stm32f103/Project/STM32F10x_StdPeriph_Template/main.c
/**
  ******************************************************************************
  * @file    TIM/InputCapture/main.c 
  * @author  MCD Application Team
  * @version V3.5.0
  * @date    08-April-2011
  * @brief   Main program body
  ******************************************************************************
  * @attention
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2011 STMicroelectronics</center></h2>
  ******************************************************************************
  */ 

/* Includes ------------------------------------------------------------------*/
#include "stm32f10x.h"
#include "stm32f10x_it.h"
#include "project.h"
#include <stdio.h>
#include <math.h>

#define PUTCHAR_PROTOTYPE int fputc(int ch, FILE *f)
/** @addtogroup STM32F10x_StdPeriph_Examples
  * @{
  */

/** @addtogroup TIM_Input_Capture
  * @{
  */ 

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
TIM_ICInitTypeDef  TIM_ICInitStructure;
EXTI_InitTypeDef   EXTI_InitStructure;
EXTI_InitTypeDef   EXTI_InitStructure;
GPIO_InitTypeDef   GPIO_InitStructure;
NVIC_InitTypeDef   NVIC_InitStructure;
USART_InitTypeDef  USART_InitStructure;
SPI_InitTypeDef   SPI_InitStructure;

/* Private function prototypes -----------------------------------------------*/
void RCC_Configuration(void);
void GPIO_Configuration(void);
void NVIC_Configuration(void);
void USART_Configuration(void);
void SPI_Configuration(void);
void ADC_Configuration(void);
void MEASUREMENT(void);
void DELAY(__IO uint32_t nCount);
void init_timer(void);
void init_dma(void);
void dma_NVIC(void);

uint16_t Capture[6][30]={0};

volatile uint8_t state = 0;
volatile uint8_t timeout_flag = 0;
volatile uint8_t sending = 0;
volatile uint8_t send_flag = 0;
volatile uint8_t address_flag = 0;
UART_SendTypeDef last_read  = SEND_DATA;

char mode='R';
uint32_t size=25;
float Frequency = 0;
float Frequency_last[6];
uint8_t online_count[6] = {0,0,0,0,0,0};
uint8_t limit_count = 5;

float Temperature = 0;
float cycleaverage[6] = {0};

unsigned char board_num1 = 0xAA;
unsigned char board_num2 = 0xAB;
uint8_t module_per_group = 1;

int STIMULATE_LOW[6] = {
	200,
	200,
	200,
	200,
	200,
	200};

int STIMULATE_HIGH[6] = {
	2200,
	2200,
	2200,
	2200,
	2200,
	2200};

	
float	A = 0.0014051f;
float B = 0.0002369f;
float C = 0.0000001019f;

void uart_zigbee_senddata(uint8_t *str);
void uart_485_senddata(uint8_t *str, uint8_t num);
UART_SendTypeDef UART_SendEnum  = SEND_NONE;

uint8_t volt_buf[4] = {'S', 0, 0, 'E'};

uint8_t data_buf[36] = {
	'S',
	0,0,//ID
	0,0,0,0,0, //CH1 频率高8位 频率低8位 温度高8位 温度低8位
	1,0,0,0,0, //CH2 频率高8位 频率低8位 温度高8位 温度低8位
	2,0,0,0,0, //CH3 频率高8位 频率低8位 温度高8位 温度低8位
	3,0,0,0,0, //CH4 频率高8位 频率低8位 温度高8位 温度低8位 
	4,0,0,0,0, //CH5 频率高8位 频率低8位 温度高8位 温度低8位 
	5,0,0,0,0, //CH6 频率高8位 频率低8位 温度高8位 温度低8位 
	0,0,       //电量高8位 电量低8位
  'E'};

uint8_t start_buf[36] = {
	'S',
	0,0,//ID
	0,0,0,0,
	0,0,0,0,
	0,0,0,0,
	0,0,0,0,
	0,0,0,0,
	0,0,0,0,
	0,0,0,0,
	'A',
	0xff,
	0x02,
	0xff,
  'A'};

uint8_t reply_buf[36] = {
	'S',
	0,0,//ID
	0,0,0,0,
	0,0,0,0,
	0,0,0,0,
	0,0,0,0,
	0,0,0,0,
	0,0,0,0,
	0,0,0,0,
	0xff,
	0xff,
	0x00,
	0xff,
  'A'};

uint8_t adc_channel_map[6] = {
	ADC_Channel_10,
	ADC_Channel_11,
	ADC_Channel_12,
	ADC_Channel_13,
	ADC_Channel_0,
	ADC_Channel_1};

GPIO_TypeDef* ADR_GPIO[8] = {
	GPIOB, 
	GPIOB, 
  GPIOB, 
  GPIOB, 
  GPIOB, 
  GPIOC,
	GPIOC,
	GPIOC};

uint16_t ADR_PIN[8] = {
	ID_PIN_ADR1, 
  ID_PIN_ADR2, 
  ID_PIN_ADR3, 
  ID_PIN_ADR4, 
  ID_PIN_ADR5, 
  ID_PIN_ADR6,
	ID_PIN_ADR7,
	ID_PIN_ADR8};
	
GPIO_TypeDef* STRING_GPIO[6] = {
	GPIOC, 
	GPIOC, 
  GPIOC, 
  GPIOC, 
  GPIOA, 
  GPIOA};

uint16_t STRING_PIN[6] = {
	STRING_PIN_CEA, 
  STRING_PIN_CEB, 
  STRING_PIN_CEC, 
  STRING_PIN_CED, 
  STRING_PIN_CEE, 
  STRING_PIN_CEF};

DMA_Channel_TypeDef* STRING_DMA_CHANNEL[6] = {
	DMA1_Channel1, 
	DMA1_Channel7, 
	DMA1_Channel2, 
	DMA1_Channel3, 
	DMA1_Channel5, 
	DMA1_Channel6};

TIM_TypeDef* STRING_TIM[6] = {
	TIM2, 
  TIM2, 
	TIM3, 
	TIM3, 
	TIM4, 
  TIM3};
	
/* Private functions ---------------------------------------------------------*/
/*void TEST()
{
	unsigned int i,j,k;
	
	i = 2100;	
  while(i>=1000)
	{
		j = 200;

		GPIO_SetBits(STRING_GPIO[0], STRING_PIN[0]);  
			
		while(j)
		{    
				__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();
				j = j - 1;
		}  
		
		j = 200;
		GPIO_ResetBits(STRING_GPIO[0], STRING_PIN[0]); 			
		while(j)
		{  
			 __nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();
			 j = j - 1;
		}    
		
		i = i - 1; 
	}
	
	DELAY(1500);                                                                                                                                                                                                                       
}	
*/	
void read_ID()
{
	int i;
	
	board_num1 = 0;
	board_num2 = 0;
	for(i = 0;i < 4;i ++)
	{
		if(GPIO_ReadInputDataBit(ADR_GPIO[i], ADR_PIN[i]) == Bit_RESET)
		{
			board_num1 |= (1 << i);
		}
	}
	for(i = 0;i < 4;i ++)
	{
		if(GPIO_ReadInputDataBit(ADR_GPIO[i + 4], ADR_PIN[i + 4]) == Bit_RESET)
		{
			board_num2 |= (1 << i);
		}
	}
	
	data_buf[1] = board_num1;
	data_buf[2] = board_num2;
}

uint16_t read_flash()
{
	uint16_t value;
	value = *(uint16_t*)(FLASH_START_ADDR);
	return value;
}
	
void write_to_data_buf(int num,uint16_t Freq, uint16_t Temp)
{
	data_buf[3 + num * 5 + 1] = (uint8_t)((Freq&0xff00)>>8);
	data_buf[3 + num * 5 + 2] = (uint8_t)(Freq&0x00ff);
	data_buf[3 + num * 5 + 3] = (uint8_t)((Temp&0xff00)>>8);
	data_buf[3 + num * 5 + 4] = (uint8_t)(Temp&0x00ff);
}

