imjustadog/string-jn5168-stm32f103/Project/STM32F10x_StdPeriph_Template/main.c
float get_temperature(int ch)
{
	int i;
	float result = 0;
	ADC_RegularChannelConfig(ADC1, adc_channel_map[ch], 1, ADC_SampleTime_239Cycles5);			    
  for(i=0;i<8;i++)
	{
		ADC_SoftwareStartConvCmd(ADC1, ENABLE);
		while(!ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC ));
		result+=ADC_GetConversionValue(ADC1);
	}
	result=result/8;
	return result;
}

void capture()
{
		int i;
		float temp_log;
	  
	  GPIO_SetBits(GPIOA, STRING_PIN_SWITCH); 
		DELAY(1000);
		MEASUREMENT();
		for(i = 0;i < 6;i ++)
		{
				state = 1;
			  timeout_flag = 1;
				TIM_Cmd(STRING_TIM[i], ENABLE); 
				DMA_Cmd(STRING_DMA_CHANNEL[i],ENABLE);			
				while((state != 0) && (timeout_flag < 3)) ;
				if(state == 1)
				{
					TIM_Cmd(STRING_TIM[i], DISABLE); 
					DMA_Cmd(STRING_DMA_CHANNEL[i],DISABLE);
				}
				state = 0;
				timeout_flag = 0;
		}
		while(sending != 0) ;
		for(i = 0;i < 6; i ++)
		{
			  Frequency=240000000.0f/cycleaverage[i] + 0.5f;	//10 times of real frequency
			  Temperature = get_temperature(i);
			  temp_log = log(Temperature * 4.5185f);
			  Temperature = (1.0f / (A + B * temp_log + C * temp_log * temp_log * temp_log) - 273.2f) * 100.0f;  //100 times of real temperature
			  write_to_data_buf(i,(uint16_t)(Frequency),(uint16_t)(Temperature));	
		}
	  GPIO_ResetBits(GPIOA, STRING_PIN_SWITCH);
}
/**
  * @brief  Main program
  * @param  None
  * @retval None
  */
int main(void)
{
	/*!< At this stage the microcontroller clock setting is already configured, 
       this is done through SystemInit() function which is called from startup
       file (startup_stm32f10x_xx.s) before to branch to application main.
       To reconfigure the default setting of SystemInit() function, refer to
       system_stm32f10x.c file
     */     
	
  RCC_Configuration();
  NVIC_Configuration();
  GPIO_Configuration();
	SPI_Configuration();
	ADC_Configuration();
  init_timer();
	dma_NVIC();
	init_dma();
	USART_Configuration();

  GPIO_SetBits(GPIOA, ZIGBEE_PIN_RESET); //开zigbee
	GPIO_ResetBits(GPIOD, RS485_DE); 
	
	read_ID();
	if(read_flash() != 45)
		last_read = SEND_DATA;
	else last_read = SEND_SLEEP;
		

	start_buf[1] = data_buf[1];
	start_buf[2] = data_buf[2];
	reply_buf[1] = data_buf[1];
	reply_buf[2] = data_buf[2];

  while (1)
	{

			if(UART_SendEnum == SEND_DATA)
			{
				if(send_flag == 1)
				{
					capture();
					uart_zigbee_senddata(data_buf);
					send_flag = 0;
				}	
		  }
	  
			if(address_flag == 1 && UART_SendEnum != SEND_NONE)
			{
				uart_zigbee_senddata(start_buf);
				address_flag = 0;
			}
		//TEST();
		//capture();
		
		/*GPIO_SetBits(GPIOD, RS485_DE); 
	  uart_485_senddata(data_buf, 36);
		GPIO_ResetBits(GPIOD, RS485_DE);*/
	}
	
}

/*void get_channel(int ch)
{
	switch(ch)
	{
		case 0:
		{
			STRING_GPIO = GPIOC;
			STRING_PIN = GPIO_Pin_8;
			STRING_TIM = TIM2;
			STRING_DMA_CHANNEL = DMA1_Channel1;
			break;
		}
		case 1:
		{
			STRING_GPIO = GPIOC;
			STRING_PIN = GPIO_Pin_9;
			STRING_TIM = TIM2;
			STRING_DMA_CHANNEL = DMA1_Channel7;
			break;
		}
		case 2:
		{
			STRING_GPIO = GPIOA;
			STRING_PIN = GPIO_Pin_8;
			STRING_TIM = TIM3;
			STRING_DMA_CHANNEL = DMA1_Channel2;
			break;
		}
		case 3:
		{
			STRING_GPIO = GPIOA;
			STRING_PIN = GPIO_Pin_9;
			STRING_TIM = TIM3;
			STRING_DMA_CHANNEL = DMA1_Channel3;
			break;
		}
		case 4:
		{
			STRING_GPIO = GPIOA;
			STRING_PIN = GPIO_Pin_10;
			STRING_TIM = TIM4;
			STRING_DMA_CHANNEL = DMA1_Channel5;
			break;
		}
		case 5:
		{
			STRING_GPIO = GPIOA;
			STRING_PIN = GPIO_Pin_11;
			STRING_TIM = TIM3;
			STRING_DMA_CHANNEL = DMA1_Channel6;
			break;
		}
		default:break;
	}
}*/

/**
  * @brief  Configures the different system clocks.
  * @param  None
  * @retval None
  */
void RCC_Configuration(void)
{
  /* TIM3 clock enable */
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE);
	RCC_ADCCLKConfig(RCC_PCLK2_Div6);   

  /* GPIOA and GPIOB clock enable */
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOD, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);
}

void dma_NVIC(void)
{
  NVIC_InitTypeDef NVIC_InitStructure;
  //NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;

	NVIC_InitStructure.NVIC_IRQChannel = DMA1_Channel1_IRQn;
  NVIC_Init(&NVIC_InitStructure);
	
  NVIC_InitStructure.NVIC_IRQChannel = DMA1_Channel7_IRQn;
  NVIC_Init(&NVIC_InitStructure);
	
  NVIC_InitStructure.NVIC_IRQChannel = DMA1_Channel2_IRQn;
  NVIC_Init(&NVIC_InitStructure);
	
	NVIC_InitStructure.NVIC_IRQChannel = DMA1_Channel3_IRQn;
  NVIC_Init(&NVIC_InitStructure);
	
	NVIC_InitStructure.NVIC_IRQChannel = DMA1_Channel5_IRQn;
  NVIC_Init(&NVIC_InitStructure);
	
	NVIC_InitStructure.NVIC_IRQChannel = DMA1_Channel6_IRQn;
  NVIC_Init(&NVIC_InitStructure);
	
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 2;
	NVIC_InitStructure.NVIC_IRQChannel = TIM6_DAC_IRQn;
	NVIC_Init(&NVIC_InitStructure);
}

 void init_dma(void)
 { 
    DMA_InitTypeDef DMA_InitStructure;
	  DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;
    DMA_InitStructure.DMA_BufferSize = size;
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
    DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;
    DMA_InitStructure.DMA_Priority = DMA_Priority_High;
    DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
  
	  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);	 
	 /*PHZ1*/
	  DMA_DeInit(DMA1_Channel1);
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)(&TIM2->CCR3);
    DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)Capture[0];
	 	DMA_Init(DMA1_Channel1,&DMA_InitStructure);              
    DMA_ITConfig(DMA1_Channel1, DMA_IT_TC, ENABLE);

	  /*PHZ2*/
	 	DMA_DeInit(DMA1_Channel7);
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)(&TIM2->CCR4);
    DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)Capture[1];
	  DMA_Init(DMA1_Channel7,&DMA_InitStructure);              
    DMA_ITConfig(DMA1_Channel7, DMA_IT_TC, ENABLE);
		
