imjustadog/string-jn5168-stm32f103/Project/STM32F10x_StdPeriph_Template/main.c
		/*PHZ3*/
	  DMA_DeInit(DMA1_Channel2);
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)(&TIM3->CCR3);
    DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)Capture[2];
 	  DMA_Init(DMA1_Channel2,&DMA_InitStructure);              
    DMA_ITConfig(DMA1_Channel2, DMA_IT_TC, ENABLE);
		
		/*PHZ4*/
	  DMA_DeInit(DMA1_Channel3);
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)(&TIM3->CCR4);
    DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)Capture[3];
 	  DMA_Init(DMA1_Channel3,&DMA_InitStructure);              
    DMA_ITConfig(DMA1_Channel3, DMA_IT_TC, ENABLE);
		
		/*PHZ5*/
	  DMA_DeInit(DMA1_Channel5);
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)(&TIM4->CCR3);
    DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)Capture[4];
 	  DMA_Init(DMA1_Channel5,&DMA_InitStructure);              
    DMA_ITConfig(DMA1_Channel5, DMA_IT_TC, ENABLE);
		
		/*PHZ6*/
	  DMA_DeInit(DMA1_Channel6);
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)(&TIM3->CCR1);
    DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)Capture[5];
    DMA_Init(DMA1_Channel6,&DMA_InitStructure);              
    DMA_ITConfig(DMA1_Channel6, DMA_IT_TC, ENABLE);
		
		DMA_Cmd(DMA1_Channel1,DISABLE);	 
		DMA_Cmd(DMA1_Channel7,DISABLE);	 
		DMA_Cmd(DMA1_Channel2,DISABLE);	 
		DMA_Cmd(DMA1_Channel3,DISABLE);	 
		DMA_Cmd(DMA1_Channel5,DISABLE);	 
		DMA_Cmd(DMA1_Channel6,DISABLE);	 
 }

 void init_timer(void)
{
    TIM_TimeBaseInitTypeDef timInitStruct;
    TIM_ICInitTypeDef tim_icinit;
	
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2,ENABLE);
	  RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3,ENABLE);
	  RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4,ENABLE);
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM6,ENABLE);
  
	  timInitStruct.TIM_ClockDivision = TIM_CKD_DIV1;                
    timInitStruct.TIM_Prescaler = 0;                    
    timInitStruct.TIM_CounterMode = TIM_CounterMode_Up;     
    timInitStruct.TIM_RepetitionCounter = 0;  
    timInitStruct.TIM_Period = 0xffff; 
	
	  TIM_DeInit(TIM2);
    TIM_InternalClockConfig(TIM2);                                
	  TIM_TimeBaseInit(TIM2, &timInitStruct);
  
	  TIM_DeInit(TIM3);
    TIM_InternalClockConfig(TIM3);                                
	  TIM_TimeBaseInit(TIM3, &timInitStruct);
	
		TIM_DeInit(TIM4);
    TIM_InternalClockConfig(TIM4);                                
	  TIM_TimeBaseInit(TIM4, &timInitStruct);
		
		timInitStruct.TIM_ClockDivision = TIM_CKD_DIV1;                
    timInitStruct.TIM_Prescaler = 23999;                    
    timInitStruct.TIM_CounterMode = TIM_CounterMode_Up;     
    timInitStruct.TIM_RepetitionCounter = 0;  
    timInitStruct.TIM_Period = 999; 
		
		TIM_DeInit(TIM6);
    TIM_InternalClockConfig(TIM6);                                
	  TIM_TimeBaseInit(TIM6, &timInitStruct);
		TIM_ITConfig(TIM6,TIM_IT_Update,ENABLE);
    
    tim_icinit.TIM_ICFilter = 0x0;
    tim_icinit.TIM_ICPolarity = TIM_ICPolarity_Falling;
    tim_icinit.TIM_ICPrescaler= TIM_ICPSC_DIV1;
    tim_icinit.TIM_ICSelection = TIM_ICSelection_DirectTI;
    
		tim_icinit.TIM_Channel = TIM_Channel_3;
	  TIM_ICInit(TIM2,&tim_icinit); 
		
		tim_icinit.TIM_Channel = TIM_Channel_4;
	  TIM_ICInit(TIM2,&tim_icinit); 
    
		tim_icinit.TIM_Channel = TIM_Channel_3;
	  TIM_ICInit(TIM3,&tim_icinit); 
		
		tim_icinit.TIM_Channel = TIM_Channel_4;
	  TIM_ICInit(TIM3,&tim_icinit); 
		
		tim_icinit.TIM_Channel = TIM_Channel_3;
	  TIM_ICInit(TIM4,&tim_icinit); 
		
		tim_icinit.TIM_Channel = TIM_Channel_1;
	  TIM_ICInit(TIM3,&tim_icinit); 
		
		TIM_ARRPreloadConfig(TIM2, DISABLE);  
    TIM_SelectInputTrigger(TIM2, TIM_TS_TI2FP2);
    TIM_SelectSlaveMode(TIM2, TIM_SlaveMode_Reset);
    TIM_SelectMasterSlaveMode(TIM2, TIM_MasterSlaveMode_Enable);
		
		TIM_ARRPreloadConfig(TIM3, DISABLE);  
    TIM_SelectInputTrigger(TIM3, TIM_TS_TI2FP2);
    TIM_SelectSlaveMode(TIM3, TIM_SlaveMode_Reset);
    TIM_SelectMasterSlaveMode(TIM3, TIM_MasterSlaveMode_Enable);
    
		TIM_ARRPreloadConfig(TIM4, DISABLE);  
    TIM_SelectInputTrigger(TIM4, TIM_TS_TI2FP2);
    TIM_SelectSlaveMode(TIM4, TIM_SlaveMode_Reset);
    TIM_SelectMasterSlaveMode(TIM4, TIM_MasterSlaveMode_Enable);
		
		TIM_DMAConfig(TIM2,TIM_DMABase_CCR3,TIM_DMABurstLength_1Byte);
    TIM_DMACmd(TIM2, TIM_DMA_CC3, ENABLE);
		
		TIM_DMAConfig(TIM2,TIM_DMABase_CCR4,TIM_DMABurstLength_1Byte);
    TIM_DMACmd(TIM2, TIM_DMA_CC4, ENABLE);
		
		TIM_DMAConfig(TIM3,TIM_DMABase_CCR3,TIM_DMABurstLength_1Byte);
    TIM_DMACmd(TIM3, TIM_DMA_CC3, ENABLE);
		
		TIM_DMAConfig(TIM3,TIM_DMABase_CCR4,TIM_DMABurstLength_1Byte);
    TIM_DMACmd(TIM3, TIM_DMA_CC4, ENABLE);
		
		TIM_DMAConfig(TIM4,TIM_DMABase_CCR3,TIM_DMABurstLength_1Byte);
    TIM_DMACmd(TIM4, TIM_DMA_CC3, ENABLE);
		
		TIM_DMAConfig(TIM3,TIM_DMABase_CCR1,TIM_DMABurstLength_1Byte);
    TIM_DMACmd(TIM3, TIM_DMA_CC1, ENABLE);
		
		TIM_Cmd(TIM2, DISABLE); 
		TIM_Cmd(TIM3, DISABLE); 
		TIM_Cmd(TIM4, DISABLE); 
		TIM_Cmd(TIM6, ENABLE);
}
/**
  * @brief  Configure the GPIOD Pins.
  * @param  None
  * @retval None
  */
void GPIO_Configuration(void)
{
  GPIO_InitTypeDef GPIO_InitStructure;
	
	GPIO_PinRemapConfig(GPIO_Remap_SWJ_JTAGDisable, ENABLE);      /*??SWD ??JTAG*/

  /* DMA */
  GPIO_InitStructure.GPIO_Pin =  STRING_PIN_PHZ1|STRING_PIN_PHZ2|STRING_PIN_PHZ6;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
	
  GPIO_InitStructure.GPIO_Pin =  STRING_PIN_PHZ3|STRING_PIN_PHZ4|STRING_PIN_PHZ5;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOB, &GPIO_InitStructure);

  /* output */
  GPIO_InitStructure.GPIO_Pin = ZIGBEE_PIN_RESET|STRING_PIN_CEE|STRING_PIN_CEF|STRING_PIN_SWITCH;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Pin = STRING_PIN_CEA|STRING_PIN_CEB|STRING_PIN_CEC|STRING_PIN_CED;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOC, &GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Pin = RS485_DE;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOD, &GPIO_InitStructure);
	
