imjustadog/string-jn5168-stm32f103/Project/STM32F10x_StdPeriph_Template/main.c
		i = i - 1; 
	}
	
	GPIO_ResetBits(STRING_GPIO[1], STRING_PIN[1]);
	GPIO_ResetBits(STRING_GPIO[3], STRING_PIN[3]);
	GPIO_ResetBits(STRING_GPIO[5], STRING_PIN[5]);
	
	DELAY(4000);                                                                                                                                                                                                                       
}

void DELAY(__IO uint32_t nCount)
{
  	unsigned int i,j;
	
  	for(i=0;i<50;i++)
  	{
	  	for(j=0;j<nCount;j++)
   		{
	   		__nop();
    	}
   } 	
}

void uart_zigbee_senddata(uint8_t *str)
{
	int i;
	for(i = 0;i < 36;i ++)
	{
		USART_SendData(USART3, *(str + i));

		/* Loop until the end of transmission */
		while (USART_GetFlagStatus(USART3, USART_FLAG_TC) == RESET)
		{}
	}
}

void uart_485_senddata(uint8_t *str, uint8_t num)
{
	int i;
	for(i = 0;i < num;i ++)
	{
		USART_SendData(UART4, *(str + i));

		/* Loop until the end of transmission */
		while (USART_GetFlagStatus(UART4, USART_FLAG_TC) == RESET)
		{}
	}
}

PUTCHAR_PROTOTYPE
{
  /* Place your implementation of fputc here */
  /* e.g. write a character to the USART */
  USART_SendData(USART3, (uint8_t) ch);

  /* Loop until the end of transmission */
  while (USART_GetFlagStatus(USART3, USART_FLAG_TC) == RESET)
  {}

  return ch;
}

#ifdef  USE_FULL_ASSERT

/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  while (1)
  {}
}

#endif

/**
  * @}
  */ 

/**
  * @}
  */ 

/******************* (C) COPYRIGHT 2011 STMicroelectronics *****END OF FILE****/
